In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('study_marks.csv')

In [6]:
df

   Study_Hours  Marks
0          2.9   27.0
1          5.8   61.0
2          4.7   45.0
3          4.0   38.0
4          1.8   19.0
5          1.8    8.0
6          1.3    4.0
7          5.3   50.0
8          4.0   35.0
9          4.5   47.0

In [4]:
df.cov()

             Study_Hours       Marks
Study_Hours     2.481000   28.906667
Marks          28.906667  348.711111

In [7]:
df.corr()

             Study_Hours    Marks
Study_Hours      1.00000  0.98277
Marks            0.98277  1.00000

In [9]:
df

   Study_Hours  Marks
0          2.9   27.0
1          5.8   61.0
2          4.7   45.0
3          4.0   38.0
4          1.8   19.0
5          1.8    8.0
6          1.3    4.0
7          5.3   50.0
8          4.0   35.0
9          4.5   47.0

In [10]:
df=pd.read_csv('TEMP.csv')

In [11]:
df

   Temperature      Sunny
0           34         50
1           24         45
2           34         36
3           12         56
4           67         78
5           78         89
6           89         78

In [12]:
df.cov()

             Temperature       Sunny
Temperature   867.571429  487.761905
    Sunny     487.761905  397.571429

In [13]:
df.corr()

             Temperature      Sunny
Temperature     1.000000   0.830515
    Sunny       0.830515   1.000000

In [14]:
df.var()

Temperature    867.571429
    Sunny      397.571429
dtype: float64